Repository: xentaos/xenta-translations
Catalog: po-export/xentasources/xentasources-*.po
Languages: ar

source: More info: %s
ar: المزيد من المعلومات: %s

source: Unable to prompt for response. Please run with -y
ar: فشل طلب الإجابة. رجاءً شغل بـالخيار -y

source: Adding PPAs is not supported
ar: إضافة المستودعات الشخصية PPA غير مدعوم

source: Cannot add PPA: '%s'.
ar: تعذّر إضافة الـPPA: '%s'.

source: Adding private PPAs is not supported currently
ar: إضافة أرشيفات حزم شخصية خاصة غير مدعوم حاليا

source: Sources
ar: المصادر

source: CD-ROM (Installation Disc)
ar: قرص التنصيب (CD-ROM)

source: Linux Mint uses Romeo to publish packages which are not tested. Once these packages are tested, they are then moved to the official repositories. Unless you are participating in beta-testing, you should not enable this repository. Are you sure you want to enable Romeo?
ar: لينكس منت تستعمل المستودع "روميو" لإطلاق البرامج التي لم يتم اختبارها بعد، وعند اختبارها، تدخل إذن في المستودعات الرسمية، إلا إذا كنت مختبرا للبرامج، لا يجب عليك تفعيل هذا الخيار. هل تريد تفعيل المستودع "روميو"؟

source: Select a mirror
ar: اختر مرآة

source: Country
ar: الدولة

source: URL
ar: الرابط

source: Speed
ar: السرعة

source: kB/s
ar: ك.بايت/ث

source: MB/s
ar: م.بايت/ث

source: GB/s
ar: ج.بايت/ث

source: Software Sources
ar: مصادر البرمجيات

source: Backported packages
ar: حزم اختبارية

source: Unstable packages
ar: حزم غير مستقرة

source: No action required
ar: لا إجراء مطلوب

source: Official repositories
ar: المستودعات الرسمية

source: Additional repositories
ar: المستودعات الإضافية

source: Authentication keys
ar: مفاتيح الإستيثاق

source: Maintenance
ar: الصيانة

source: Mirrors
ar: المرايا

source: Main
ar: رئيسي

source: Base
ar: أساسي

source: Select a faster server...
ar: اختر خادمًا أسرع...

source: Optional components
ar: المكونات الإضافية

source: Source code
ar: شيفرة مصدرية

source: Add a new PPA...
ar: أضف PPA جديد...

source: Edit URL...
ar: حرر الرابط...

source: Add a new repository...
ar: أضف مستودعًا جديدًا...

source: Import key file...
ar: استورد ملف المفتاح...

source: Download a key...
ar: حمل مفتاحًا...

source: Fix MergeList problems
ar: أصلح مشاكل MergeList

source: If you experience MergeList problems, click this button to solve the problem.
ar: إذا واجهت مشاكل MergeList، اضغط هذا الزر لإصلاح المشكلة

source: Purge residual configuration
ar: أزل الإعدادات الزائدة

source: Packages sometimes leave configuration files on the system even after they are removed.
ar: تترك الحزم أحيانًا ملفات الإعداد على النظام حتى بعد أن يتم حذفها

source: Enable source code repositories
ar: فعّل مستودعات الشيفرة المصدرية

source: Enabled
ar: مُفَعلّ

source: Repository
ar: مستودع

source: Key
ar: مفتاح

source: Restore the default settings
ar: استرجع الإعدادات الافتراضية

source: Restore the official repositories to their default settings
ar: استرجع المستودعات الرسمية لإعداداتها الافتراضية

source: There is no more residual configuration on the system.
ar: لايوجد المزيد من الإعدادات الزائدة على النظام

source: The problem was fixed. Please reload the cache.
ar: تم إصلاح المشكلة، رجاءًا أعد تحميل الخبيئة

source: Open..
ar: افتح..

source: Please enter the 8 characters of the public key you want to download from keyserver.ubuntu.com:
ar: رجاءًا أدخل 8 محارف من المفتاح العمومي الذي تريد تحميله من keyserver.ubuntu.com:

source: Are you sure you want to permanently remove this key?
ar: هل أنت متأكد من أنك تريد حذف هذا المفتاح نهائيًا؟

source: Please enter the name of the PPA you want to add:
ar: رجاءًا أدخل اسم الـPPA الذي تريد إضافته:

source: Edit the URL of the PPA
ar: حرر رابط الـPPA

source: Are you sure you want to permanently remove this PPA?
ar: هل أنت متأكد من أنك تريد حذف هذا الـPPA نهائيًا؟

source: Please enter the name of the repository you want to add:
ar: رجاءًا أدخل اسم المستودع الذي تريد إضافته:

source: Edit the URL of the repository
ar: حرر رابط المستودع

source: Are you sure you want to permanently remove this repository?
ar: هل أنت متأكد من أنك تريد حذف هذا المستودع نهائيًا؟

source: Update the cache
ar: حدثّ الخبيئة

source: Click here to update your APT cache with your new sources
ar: اضغط هنا لتحديث خبيئة APT مع مصادر الحزم الجديدة

source: Your APT cache is up to date
ar: خبيئة APT هي الأحدث

source: Please enter your password to configure the software sources
ar: رجاءًا أدخل كلمة المرور لإعداد مصادر البرمجيات

source: Error: must run as root
ar: خطأ: يجب تشغيله بصلاحية الجذر

source: Error: need a repository as argument
ar: خطأ: يحتاج مستودعاً معطى

source: Configure the sources for installable software and updates
ar: إعداد المصادر للبرمجيات والتحديثات القابلة للتثبيت
